app/controllers/root_controller.rb

SELECT "identities".* FROM "identities" WHERE "identities"."user_id" = $1 ORDER BY "identities"."id" ASC LIMIT 1  [["user_id", 2]]
---
  def soundcloud_post
    file = params[:file]
    picture = params[:picture]
    client = Soundcloud.new(:access_token => current_user.identities.first.auth_token)